Revit 2024 API
BuiltInFailures.RebarFailures.RebarInvalidDiameterRemoved Property
 Invalid RebarBarType was removed on upgrade.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarInvalidDiameterRemoved { get; }
Visual Basic
Public Shared ReadOnly Property RebarInvalidDiameterRemoved As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarInvalidDiameterRemoved {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace